---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepCutsWallParam
source: html/ed3d3446-94bc-da01-7cdf-35f7c1304cb6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepCutsWallParam Property

"Cuts Wall"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepCutsWallParam { get; }
```